INSERT INTO public.route (title,duration_days,estimated_budget_rub,img) VALUES
	 ('Kazan – Kavkaz',5,15000,'kazan_kavkaz.jpg'),
	 ('Sergiev Posad',1,2000,'sergiev_posad.jpg');

INSERT INTO public.city ("name",lat,lon,yandex_code) VALUES
	 ('Казань',55.7944,49.111,'c43'),
	 ('Набережные челны',55.7441,52.3957,'c236'),
	 ('Уфа',54.7388,55.9721,'c172'),
	 ('Пятигорск',44.0377,43.0547,'c11067'),
	 ('Сергиев Посад',56.3,38.1333,'c10752');
INSERT INTO public.route_city (route_id,city_id,"order") VALUES
	 (1,1,1),
	 (1,2,2),
	 (1,3,3),
	 (1,4,4),
	 (2,5,1);
INSERT INTO public."day" (route_id,day_order) VALUES
	 (1,1),
	 (1,2),
	 (1,3),
	 (1,4),
	 (1,5),
	 (2,1),
	 (2,2);
INSERT INTO public.day_variant ("name",est_budget,day_id,is_default) VALUES
	 ('Sightseeing Kazan Kremlin',3000,1, True),
	 ('Riverboat Cruise on Kazanka',2000,1, False),
	 ('Bus to Naberezhnye Chelny + Local Tour',2500,2, True),
	 ('Train to Ufa + City Walk',4000,3, True),
	 ('Bus from Ufa to Caucasus (Kavkaz)',3500,4, True),
	 ('Relax at Kavkaz',2000,5, True),
	 ('Trinity Sergius Lavra Visit',1000,6, True),
	 ('Local Museum + Cathedral Tour',800,7, True);
INSERT INTO public.meal_place ("name",coords,cuisine,website,avg_check_rub,rating,updated_at,city_id,open_time,close_time,created_at) VALUES
	 ('Пельмешки','56.3091,38.1378',1,'https://pelmeshki.ru',400,4.1,'2025-06-11 16:44:15.375638',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('La Foret','56.3112,38.1392',10,'https://laforet-sp.ru',1200,4.5,'2025-06-11 16:44:15.375638',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Дворик у Лавры','56.3075,38.1343',11,'https://dvoryk-lavra.ru',900,4.3,'2025-06-11 16:44:15.375638',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Рубаи','55.7887,49.1221',11,'https://rubai.ru',800,4.6,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Тюбетей','55.7961,49.1082',11,'https://tubetey.ru',500,4.4,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Гуси-Лебеди','55.7953,49.1099',1,'https://gusilebedi.ru',850,4.5,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Трапезная Лавры','56.3160,38.1329',1,'https://lavrafood.ru',450,4.7,'2025-06-11 16:44:19.654743',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Сергиев Посад — Пельменная на пруду','56.3175,38.1374',1,'https://pelmeni-sp.ru',500,4.7,'2025-06-11 16:44:19.654743',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Сергиев Посад — Кафе «Белый Хлеб»','56.3144,38.1292',10,'https://belyhleb.ru',600,4.7,'2025-06-11 16:44:19.654743',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Рядом с театром — Teatro Italiano','55.7958,49.1265',2,'https://teatrokzn.ru',1400,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638');
INSERT INTO public.meal_place ("name",coords,cuisine,website,avg_check_rub,rating,updated_at,city_id,open_time,close_time, created_at) VALUES
	 ('Сайгон','55.7923,49.1311',0,'https://saigon-kzn.ru',750,4.3,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Кремлёвская столовая','55.7971,49.1062',10,'https://kremstol.ru',400,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Дрова','55.7915,49.1147',1,'https://drova.ru',1000,4.3,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Националь Кафе','55.7960,49.1090',11,'https://nationalcafe.ru',950,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Улица Баумана — Burger Brothers','55.7952,49.1081',8,'https://burgerbros.ru',650,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Кафе Бауманка','55.7982,49.1115',10,'https://bauman-cafe.ru',800,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Malabar','55.7901,49.1343',5,'https://malabar-kzn.ru',1200,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Basilico','55.7906,49.1352',2,'https://basilico-kzn.ru',1500,4.5,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Чайхана Халиф','55.7899,49.1163',0,'https://halif.ru',850,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638');
INSERT INTO public.meal_place ("name",coords,cuisine,website,avg_check_rub,rating,updated_at,city_id,open_time,close_time, created_at) VALUES
	 ('Около Храма всех религий — Место Встречи','55.7958,49.1002',11,'https://mestovstrechi.ru',600,4.7,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Пашмель','55.7832,49.1268',10,'https://pashmel.ru',1800,4.8,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Burger House','55.7871,49.1245',10,'https://burgerhouse.ru',700,4.2,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Трапезная Лавры','56.3086,38.1359',1,'https://lavra.ru',600,4.4,'2025-06-11 16:44:15.375638',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Вкусная Лавка','56.3067,38.1321',10,'https://vk-lavka.ru',500,4.2,'2025-06-11 16:44:15.375638',5,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Tokyo','55.7932,49.1273',7,'https://tokyo-kzn.ru',900,4.3,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Макароны & Co','55.7892,49.1303',2,'https://macaroni-co.ru',1100,4.4,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638'),
	 ('Фрида','55.7865,49.1205',3,'https://frida-kzn.ru',900,4.6,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638');
INSERT INTO public.meal_place ("name",coords,cuisine,website,avg_check_rub,rating,updated_at,city_id,open_time,close_time, created_at) VALUES
	 ('Кыстыбый House','55.796337,49.108987',11,'https://kystyby.ru',600,4.1,'2025-06-11 16:44:19.654743',1,'09:00:00','18:00:00', '2025-06-11 16:44:15.375638');
INSERT INTO public.poi ("name",must_see,open_time,close_time,rating,lat,lon) VALUES
	 ('Мечеть Кул Шариф',true,'10:00:00','18:00:00',4.7,55.798399,49.105148),
	 ('Казанский кремль',true,'09:00:00','19:00:00',4.8,55.797557,49.107295),
	 ('Дом Ушковой',false,'10:00:00','17:00:00',4.3,55.791824,49.120862),
	 ('Татарский государственный академический театр оперы и балета имени Мусы Джалиля',false,'09:00:00','19:00:00',4.1,55.79553,49.124775),
	 ('Храм всех религий',false,'10:00:00','17:00:00',4.2,55.798399,49.105148),
	 ('Троице-Сергиева Лавра',true,'08:00:00','20:00:00',4.9,55.798399,49.105148),
	 ('Улица Баумана',false,'00:00:00','23:59:00',4.5,55.798399,49.105148),
	 ('Национальный музей Республики Татарстан',true,'10:00:00','18:00:00',4.6,55.796337,49.108987),
	 ('Центр семьи «Казан»',false,'10:00:00','20:00:00',4.5,55.830803,49.066507),
	 ('Раифский монастырь',true,'09:00:00','19:00:00',4.7,55.888524,48.824232);
INSERT INTO public.poi ("name",must_see,open_time,close_time,rating,lat,lon) VALUES
	 ('Музей исламской культуры',false,'10:00:00','18:00:00',4.4,55.79741,49.108426),
	 ('Казанская ратуша',false,'09:00:00','17:00:00',4.3,55.79698,49.110681),
	 ('Парк Тысячелетия Казани',false,'06:00:00','22:00:00',4.6,55.794501,49.087722),
	 ('Казанский зооботанический сад',false,'08:00:00','20:00:00',4.2,55.776217,49.14514),
	 ('Музей игрушек Сергиева Посада',false,'10:00:00','17:00:00',4.5,56.310275,38.134595),
	 ('Гефсиманский Черниговский скит',true,'07:00:00','20:00:00',4.8,56.296273,38.160222),
	 ('Смотровая площадка «Блинная гора»',false,'00:00:00','23:59:00',4.4,56.300462,38.133761),
	 ('Музей конного двора',false,'10:00:00','18:00:00',4.3,56.313227,38.133034),
	 ('Троицкий собор в Сергиевом Посаде',true,'08:00:00','20:00:00',4.9,56.316667,38.133333);
-- INSERT INTO public.price_entry (object_type,object_id,updated_at,price) VALUES
-- 	 (1,1,'2025-06-11 16:44:15.375',500),
-- 	 (1,2,'2025-06-11 16:44:15.375',400),
-- 	 (1,3,'2025-06-11 16:44:15.375',0),
-- 	 (1,4,'2025-06-11 16:44:15.375',100),
-- 	 (1,5,'2025-06-11 16:44:15.375',700),
-- 	 (1,6,'2025-06-11 16:44:15.375',250),
-- 	 (1,7,'2025-06-11 16:44:15.375',0),
-- 	 (1,8,'2025-06-11 16:44:15.375',300),
-- 	 (1,9,'2025-06-11 16:44:15.375',350),
-- 	 (1,10,'2025-06-11 16:44:15.375',700);

INSERT INTO public.segment (variant_id,"order", "type",start_time,end_time,lodging_name,city_id,attached_next_segment_id,poi_id) VALUES
	 (2,6,0,'08:00:00','09:00:00',NULL,1,NULL,NULL),
	 (1,3,0,'12:00:00','13:00:00',NULL,1,NULL,NULL),
	 (1,5,0,'08:00:00','09:00:00',NULL,1,NULL,NULL),
	 (1,2,1,'12:00:00','13:30:00',NULL,1,NULL,2),
	 (1,7,0,'18:00:00','19:00:00',NULL,1,NULL,NULL),
	 (2,2,0,'12:00:00','13:00:00',NULL,1,NULL,NULL),
	 (2,4,0,'18:00:00','19:00:00',NULL,1,NULL,NULL),
	 (1,1,1,'09:00:00','11:00:00',NULL,1,NULL,1),
	 (3,3,0,'12:00:00','13:00:00',NULL,1,NULL,NULL),
	 (4,2,0,'08:00:00','09:00:00',NULL,1,NULL,NULL);
INSERT INTO public.segment (variant_id,"order", "type",start_time,end_time,lodging_name,city_id,attached_next_segment_id,poi_id) VALUES
	 (4,4,0,'12:00:00','13:00:00',NULL,1,NULL,NULL),
	 (5,2,0,'18:00:00','19:00:00',NULL,1,NULL,NULL),
	 (6,2,0,'12:00:00','13:00:00',NULL,1,NULL,NULL),
	 (1,4,1,'12:00:00','13:30:00',NULL,1,NULL,3),
	 (1,6,1,'12:00:00','13:30:00',NULL,1,NULL,4),
	 (2,1,1,'10:00:00','12:00:00',NULL,1,NULL,5),
	 (2,3,1,'10:00:00','12:00:00',NULL,1,NULL,6),
	 (2,5,1,'10:00:00','12:00:00',NULL,1,NULL,7),
	 (7,1,1,'09:00:00','11:30:00',NULL,5,NULL,8),
	 (8,2,1,'10:00:00','12:00:00',NULL,5,NULL,15);
INSERT INTO public.segment (variant_id,"order", "type",start_time,end_time,lodging_name,city_id,attached_next_segment_id,poi_id) VALUES
	 (3,1,1,'08:00:00','10:15:00',NULL,1,NULL,10),
	 (3,2,1,'08:00:00','10:15:00',NULL,1,NULL,11),
	 (4,1,1,'09:30:00','11:00:00',NULL,1,NULL,12),
	 (4,3,1,'09:30:00','11:00:00',NULL,1,NULL,13),
	 (5,1,1,'14:00:00','16:00:00',NULL,1,NULL,14),
	 (6,1,1,'10:00:00','12:00:00',NULL,1,NULL,9);
INSERT INTO public.trip_session (uuid,route_id,created_at,departure_city_id,start_date,end_date) VALUES
	 ('0b90c068-fead-4c3b-8c79-7738f7713ea2',1,'2025-06-09 10:30:35.78945',3,'2025-06-09','2025-06-14'),
	 ('e388f4df-8b44-4f92-833d-127b16c3ae4a',1,'2025-06-09 10:34:10.581608',3,'2025-06-09','2025-06-14');
INSERT INTO public.user (uuid,"name") VALUES
	 ('9dff5eb8-4ee6-4c46-898e-ba4fd9071d63', NULL),
	 ('78c869ee-e4c3-41d1-aeb6-456dac90c3f4', NULL),
	 ('22f6c02f-8e17-4e83-84c1-9921386c5c9c', NULL);
INSERT INTO public.trip_participant (user_uuid,session_id,join_at) VALUES
	 ('9dff5eb8-4ee6-4c46-898e-ba4fd9071d63', '1','2025-06-09 16:07:35.989155'),
	 ('78c869ee-e4c3-41d1-aeb6-456dac90c3f4', '1','2025-06-09 16:12:58.301562'),
	 ('22f6c02f-8e17-4e83-84c1-9921386c5c9c', '1','2025-06-09 16:13:20.382764');
INSERT INTO public.trip_vote (participant_id,updated_at,variant_id,day_order,session_id) VALUES
	 (1,'2025-06-09 23:32:02.161642',2,1,'1'),
	 (1,'2025-06-09 23:32:02.161642',3,2,'1'),
	 (1,'2025-06-09 23:32:02.161642',4,3,'1'),
	 (1,'2025-06-09 23:32:02.161642',5,4,'1'),
	 (1,'2025-06-09 23:32:02.161642',6,5,'1'),
	 (2,'2025-06-09 23:32:53.032908',3,2,'1'),
	 (2,'2025-06-09 23:32:53.032908',4,3,'1'),
	 (2,'2025-06-09 23:32:53.032908',5,4,'1'),
	 (2,'2025-06-09 23:32:53.032908',6,5,'1'),
	 (3,'2025-06-09 23:33:02.975251',1,1,'1');
INSERT INTO public.trip_vote (participant_id,updated_at,variant_id,day_order,session_id) VALUES
	 (3,'2025-06-09 23:33:02.975251',3,2,'1'),
	 (3,'2025-06-09 23:33:02.975251',4,3,'1'),
	 (3,'2025-06-09 23:33:02.975251',5,4,'1'),
	 (3,'2025-06-09 23:33:02.975251',6,5,'1'),
	 (2,'2025-06-10 11:29:51.566581',1,1,'1');
