INSERT INTO public.city (name,lat,lon,yandex_code,"location",slug) VALUES
	 ('Казань',55.7944,49.111,'c43', 'SRID=4326;POINT (49.111 55.7944)', 'kazan'),
	 ('Набережные челны',55.7441,52.3957,'c236', 'SRID=4326;POINT (52.3957 55.7441)', 'nabereznie-chelni'),
	 ('Уфа',54.7388,55.9721,'c172', 'SRID=4326;POINT (55.9721 54.7388)', 'ufa'),
	 ('Пятигорск',44.0377,43.0547,'c11067', 'SRID=4326;POINT (43.0547 44.0377)', 'patigorsk'),
	 ('Сергиев Посад',56.3,38.1333,'c10752', 'SRID=4326;POINT (38.1333 56.3)', 'sergiev-posad'),
	 ('Махачкала',42.9764,47.5024,'с0001', 'SRID=4326;POINT (55.9501 53.6246)', 'makhachkala'),
	 ('Sterlitimak',53.6246,55.9501,'с0000', 'SRID=4326;POINT (47.5024 42.9764)','sterlitimak');
INSERT INTO public.route (title,duration_days,estimated_budget_rub,img) VALUES
	('Kazan – Kavkaz',5,15000,'kazan_kavkaz.jpg'),
	('Sergiev Posad',2,2000,'sergiev_posad.jpg'),
	 ('Dagestan',3,4000,'dagestan.jpg'),
	 ('Ufa',4,5200,'bashkiriya.jpg'),
	 ('Sterlitimak',2,4200,'stel.jpg');
INSERT INTO public."day" (day_order,route_id) VALUES
	 (1,1),
	 (2,1),
	 (3,1),
	 (4,1),
	 (5,1),
	 (1,2),
	 (2,2);
INSERT INTO public.day_variant (name,est_budget,day_id,is_default) VALUES
	 ('Sightseeing Kazan Kremlin',3000,1,true),
	 ('Riverboat Cruise on Kazanka',2000,1,false),
	 ('Bus to Naberezhnye Chelny + Local Tour',2500,2,true),
	 ('Train to Ufa + City Walk',4000,3,true),
	 ('Bus from Ufa to Caucasus (Kavkaz)',3500,4,true),
	 ('Relax at Kavkaz',2000,5,true),
	 ('Trinity Sergius Lavra Visit',1000,6,true),
	 ('Local Museum + Cathedral Tour',800,7,true);
INSERT INTO public.meal_place (name,coords,website,avg_check_rub,open_time,close_time,rating,updated_at,city_id,created_at,"type",cuisine) VALUES
	 ('Улица Баумана — Burger Brothers','55.7952,49.1081','https://burgerbros.ru',650,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Malabar','55.7901,49.1343','https://malabar-kzn.ru',1200,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Basilico','55.7906,49.1352','https://basilico-kzn.ru',1500,'09:00:00','18:00:00',4.5,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Чайхана Халиф','55.7899,49.1163','https://halif.ru',850,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Около Храма всех религий — Место Встречи','55.7958,49.1002','https://mestovstrechi.ru',600,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Музей — Гудман кафе','55.7969,49.1078','https://goodmancafe.ru',400,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Возле Дом Ушковой — Art Café Lavanda','55.7922,49.1219','https://lavandaartcafe.ru',900,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Пашмель','55.7832,49.1268','https://pashmel.ru',1800,'09:00:00','18:00:00',4.8,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Burger House','55.7871,49.1245','https://burgerhouse.ru',700,'09:00:00','18:00:00',4.2,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Трапезная Лавры','56.3086,38.1359','https://lavra.ru',600,'09:00:00','18:00:00',4.4,'2025-06-11 16:44:15.375638',5,'2025-05-05 05:05:05.555',NULL,1);
INSERT INTO public.meal_place (name,coords,website,avg_check_rub,open_time,close_time,rating,updated_at,city_id,created_at,"type",cuisine) VALUES
	 ('Вкусная Лавка','56.3067,38.1321','https://vk-lavka.ru',500,'09:00:00','18:00:00',4.2,'2025-06-11 16:44:15.375638',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('Tokyo','55.7932,49.1273','https://tokyo-kzn.ru',900,'09:00:00','18:00:00',4.3,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Макароны & Co','55.7892,49.1303','https://macaroni-co.ru',1100,'09:00:00','18:00:00',4.4,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Фрида','55.7865,49.1205','https://frida-kzn.ru',900,'09:00:00','18:00:00',4.6,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Кыстыбый House','55.796337,49.108987','https://kystyby.ru',600,'09:00:00','18:00:00',4.1,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Пельмешки','56.3091,38.1378','https://pelmeshki.ru',400,'09:00:00','18:00:00',4.1,'2025-06-11 16:44:15.375638',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('La Foret','56.3112,38.1392','https://laforet-sp.ru',1200,'09:00:00','18:00:00',4.5,'2025-06-11 16:44:15.375638',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('Дворик у Лавры','56.3075,38.1343','https://dvoryk-lavra.ru',900,'09:00:00','18:00:00',4.3,'2025-06-11 16:44:15.375638',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('Рубаи','55.7887,49.1221','https://rubai.ru',800,'09:00:00','18:00:00',4.6,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Тюбетей','55.7961,49.1082','https://tubetey.ru',500,'09:00:00','18:00:00',4.4,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1);
INSERT INTO public.meal_place (name,coords,website,avg_check_rub,open_time,close_time,rating,updated_at,city_id,created_at,"type",cuisine) VALUES
	 ('Гуси-Лебеди','55.7953,49.1099','https://gusilebedi.ru',850,'09:00:00','18:00:00',4.5,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Трапезная Лавры','56.3160,38.1329','https://lavrafood.ru',450,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('Сергиев Посад — Пельменная на пруду','56.3175,38.1374','https://pelmeni-sp.ru',500,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('Сергиев Посад — Кафе «Белый Хлеб»','56.3144,38.1292','https://belyhleb.ru',600,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',5,'2025-05-05 05:05:05.555',NULL,1),
	 ('Рядом с театром — Teatro Italiano','55.7958,49.1265','https://teatrokzn.ru',1400,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Сайгон','55.7923,49.1311','https://saigon-kzn.ru',750,'09:00:00','18:00:00',4.3,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Кофейня №7','55.7897,49.1185','https://coffee7.ru',400,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Кремлёвская столовая','55.7971,49.1062','https://kremstol.ru',400,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Дрова','55.7915,49.1147','https://drova.ru',1000,'09:00:00','18:00:00',4.3,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1),
	 ('Националь Кафе','55.7960,49.1090','https://nationalcafe.ru',950,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1);
INSERT INTO public.meal_place (name,coords,website,avg_check_rub,open_time,close_time,rating,updated_at,city_id,created_at,"type",cuisine) VALUES
	 ('Кафе Бауманка','55.7982,49.1115','https://bauman-cafe.ru',800,'09:00:00','18:00:00',4.7,'2025-06-11 16:44:19.654743',1,'2025-05-05 05:05:05.555',NULL,1);
INSERT INTO public.poi (name,must_see,open_time,close_time,rating,lat,lon,dgis_id) VALUES
	 ('Мечеть Кул Шариф',true,'10:00:00','18:00:00',4.7,55.798399,49.105148,'1'),
	 ('Казанский кремль',true,'09:00:00','19:00:00',4.8,55.797557,49.107295,'2'),
	 ('Дом Ушковой',false,'10:00:00','17:00:00',4.3,55.791824,49.120862,'3'),
	 ('Татарский государственный академический театр оперы и балета имени Мусы Джалиля',false,'09:00:00','19:00:00',4.1,55.79553,49.124775,'4'),
	 ('Храм всех религий',false,'10:00:00','17:00:00',4.2,55.798399,49.105148,'5'),
	 ('Троице-Сергиева Лавра',true,'08:00:00','20:00:00',4.9,55.798399,49.105148,'6'),
	 ('Улица Баумана',false,'00:00:00','23:59:00',4.5,55.798399,49.105148,'7'),
	 ('Национальный музей Республики Татарстан',true,'10:00:00','18:00:00',4.6,55.796337,49.108987,'8'),
	 ('Центр семьи «Казан»',false,'10:00:00','20:00:00',4.5,55.830803,49.066507,'9'),
	 ('Раифский монастырь',true,'09:00:00','19:00:00',4.7,55.888524,48.824232,'10');
INSERT INTO public.poi (name,must_see,open_time,close_time,rating,lat,lon,dgis_id) VALUES
	 ('Музей исламской культуры',false,'10:00:00','18:00:00',4.4,55.79741,49.108426,'11'),
	 ('Казанская ратуша',false,'09:00:00','17:00:00',4.3,55.79698,49.110681,'12'),
	 ('Парк Тысячелетия Казани',false,'06:00:00','22:00:00',4.6,55.794501,49.087722,'13'),
	 ('Казанский зооботанический сад',false,'08:00:00','20:00:00',4.2,55.776217,49.14514,'14'),
	 ('Музей игрушек Сергиева Посада',false,'10:00:00','17:00:00',4.5,56.310275,38.134595,'15'),
	 ('Гефсиманский Черниговский скит',true,'07:00:00','20:00:00',4.8,56.296273,38.160222,'16'),
	 ('Смотровая площадка «Блинная гора»',false,'00:00:00','23:59:00',4.4,56.300462,38.133761,'17'),
	 ('Музей конного двора',false,'10:00:00','18:00:00',4.3,56.313227,38.133034,'18'),
	 ('Троицкий собор в Сергиевом Посаде',true,'08:00:00','20:00:00',4.9,56.316667,38.133333,'19'),
	 ('Sdom, ателье',false,'10:00:00','18:00:00',NULL,44.668048,43.014343,'70000001055526487');
INSERT INTO public.poi (name,must_see,open_time,close_time,rating,lat,lon,dgis_id) VALUES
	 ('Fablab Alania, академия',false,'12:00:00','20:00:00',NULL,44.683294,43.041315,'70000001092487558'),
	 ('Парк Отель Владикавказ, гостиница',false,'00:00:00','00:00:00',NULL,44.674439,43.026334,'70000001061227609'),
	 ('ПесчанкаОзеро, зона отдыха',false,'00:00:00','00:00:00',4.7,56.073893,93.11641,'70000001043912975'),
	 ('Причал 42',false,'07:00:00','01:00:00',NULL,52.912591,78.567564,'70000001054778629'),
	 ('Pesok 38',false,'11:00:00','23:00:00',4.7,52.290334,104.231426,'70000001055579404'),
	 ('Аэропорт Астрахань, международный аэропорт им. Б.М. Кустодиева',false,'00:00:00','00:00:00',3.4,46.287397,48.000178,'1126428187824205'),
	 ('ASTROOM, интерьерный центр',false,'10:00:00','20:00:00',4.6,56.816716,60.625484,'70000001034901123');
INSERT INTO public.route_city (route_id,city_id,"order") VALUES
	 (1,1,1),
	 (1,2,2),
	 (1,3,3),
	 (1,4,4),
	 (2,5,1),
	 (3,6,1),
	 (4,3,1),
	 (5,8,1);
INSERT INTO public.segment (variant_id,"order",attached_next_segment_id,start_time,end_time,poi_id,lodging_name,city_id,"type") VALUES
	 (2,6,NULL,'08:00:00','09:00:00',NULL,NULL,1,0),
	 (1,3,NULL,'12:00:00','13:00:00',NULL,NULL,1,0),
	 (1,5,NULL,'08:00:00','09:00:00',NULL,NULL,1,0),
	 (1,7,NULL,'18:00:00','19:00:00',NULL,NULL,1,0),
	 (2,2,NULL,'12:00:00','13:00:00',NULL,NULL,1,0),
	 (2,4,NULL,'18:00:00','19:00:00',NULL,NULL,1,0),
	 (3,3,NULL,'12:00:00','13:00:00',NULL,NULL,1,0);
INSERT INTO public.segment (variant_id,"order",attached_next_segment_id,start_time,end_time,poi_id,lodging_name,city_id,"type") VALUES
	 (4,2,NULL,'08:00:00','09:00:00',NULL,NULL,1,0),
	 (4,4,NULL,'12:00:00','13:00:00',NULL,NULL,1,0),
	 (5,2,NULL,'18:00:00','19:00:00',NULL,NULL,1,0),
	 (6,2,NULL,'12:00:00','13:00:00',NULL,NULL,1,0),
	 (1,2,NULL,'12:00:00','13:30:00',2,NULL,1,1),
	 (1,1,NULL,'09:00:00','11:00:00',1,NULL,1,1),
	 (1,4,NULL,'12:00:00','13:30:00',3,NULL,1,1),
	 (1,6,NULL,'12:00:00','13:30:00',4,NULL,1,1);
INSERT INTO public.segment (variant_id,"order",attached_next_segment_id,start_time,end_time,poi_id,lodging_name,city_id,"type") VALUES
	 (2,1,NULL,'10:00:00','12:00:00',5,NULL,1,1),
	 (2,3,NULL,'10:00:00','12:00:00',6,NULL,1,1),
	 (2,5,NULL,'10:00:00','12:00:00',7,NULL,1,1),
	 (7,1,NULL,'09:00:00','11:30:00',8,NULL,5,1),
	 (8,2,NULL,'10:00:00','12:00:00',15,NULL,5,1),
	 (3,1,NULL,'08:00:00','10:15:00',10,NULL,1,1),
	 (3,2,NULL,'08:00:00','10:15:00',11,NULL,1,1),
	 (4,1,NULL,'09:30:00','11:00:00',12,NULL,1,1),
	 (4,3,NULL,'09:30:00','11:00:00',13,NULL,1,1),
	 (5,1,NULL,'14:00:00','16:00:00',14,NULL,1,1);
INSERT INTO public.segment (variant_id,"order",attached_next_segment_id,start_time,end_time,poi_id,lodging_name,city_id,"type") VALUES
	 (6,1,NULL,'10:00:00','12:00:00',9,NULL,1,1);
INSERT INTO public.staff (first_name,last_name,login,email,"password",uuid,name,"role") VALUES
	 ('Admin','Admin','Admin','Admin@mail.mail','scrypt:32768:8:1$vWwIAi9OZckc0SHM$16fb474ef49894eb533283f1703194e85d14a2cfb9190d908f52d1ee0f4dfa813eec826e785a2715956e01d9bea5900d75859809876e3f6ebb228761b66d88cf','9dff5eb8-4ee6-4c46-898e-ba4fd9071d63'::uuid,NULL,0);
